{
    "1": {
        "player_id": "1",
        "name": "CeeDee Lamb",
        "team": "Dallas Cowboys",
        "team_short": "Dal",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "88",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4241389.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "113",
        "rushing_tds": "2",
        "receiving_yds": "1749",
        "receiving_tds": "12",
        "receptions": "135",
        "total_fpts": "403.2",
        "avg_fpts": "23.7",
        "summary": "Breakout pro bowl wide receiver CeeDee Lamb is one of the best players in fantasy football this season. Boasting the third most receiving yards in the league, and the most receptions, Lamb is a valuable player for any fantasy squad. Lamb serves as a cornerstone of any team, acting as a perennial WR1, attaining the third most votes for prestigious OPOY award in the 2023 league season. With these fantastic stats and consistent production, we can easily expect CeeDee to continue his excellent season going into the 2024 season as Dallas is only expected to reach new heights.",
        "teammates_depth_chart": [
            "49",
            "189"
        ]
    },
    "2": {
        "player_id": "2",
        "name": "Josh Allen",
        "team": "Buffalo Bills",
        "team_short": "Buf",
        "position_full": "Quarterback",
        "position": "QB",
        "number": "170",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/3918298.png&w=350&h=254",
        "passing_yds": "4306",
        "passing_tds": "29",
        "ints": "18",
        "rushing_yds": "524",
        "rushing_tds": "15",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "392.64",
        "avg_fpts": "23.1",
        "summary": "Josh Allen, the dynamic quarterback for the Buffalo Bills, has emerged as one of the most electrifying players in the NFL. Known for his cannon arm, mobility, and clutch performances, Allen has become the face of the Bills' franchise and a fan favorite across the league. With two Pro Bowl selections to his name, Allen's talent and leadership have propelled the Bills to new heights, making them perennial contenders in the AFC. His ability to make plays both with his arm and his legs has made him a nightmare for opposing defenses, earning him respect and admiration from teammates, coaches, and fans alike. As he continues to refine his game and elevate his play, Josh Allen is poised to leave a lasting legacy in Buffalo and etch his name among the NFL's elite quarterbacks.",
        "teammates_depth_chart": [
            "12",
            "34",
            "35"
        ]
    },
    "3": {
        "player_id": "3",
        "name": "Christian McCaffrey",
        "team": "San Francisco 49ers",
        "team_short": "SF",
        "position_full": "Running Back",
        "position": "RB",
        "number": "23",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/3117251.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "1459",
        "rushing_tds": "14",
        "receiving_yds": "67",
        "receiving_tds": "0",
        "receptions": "83",
        "total_fpts": "391.3",
        "avg_fpts": "24.5",
        "summary": "Christian McCaffrey, the versatile running back for the San Francisco 49ers, is a true game-changer in the NFL. Renowned for his exceptional skills as both a runner and a receiver, McCaffrey has established himself as one of the league's premier offensive weapons. In 2023, he earned the prestigious Offensive Player of the Year award, solidifying his status as one of the most dominant players in the league. Additionally, McCaffrey has garnered three First Team All-Pro selections, showcasing his consistent excellence on the field. With his unmatched versatility, explosive playmaking ability, and unmatched work ethic, McCaffrey continues to be a force to be reckoned with, leaving a lasting impact on the game each time he takes the field.",
        "teammates_depth_chart": [
            "12",
            "34",
            "35"
        ]
    },
    "4": {
        "player_id": "4",
        "name": "Tyreek Hill",
        "team": "Miami Dolphins",
        "team_short": "Mia",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "10",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/3116406.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "15",
        "rushing_tds": "0",
        "receiving_yds": "119",
        "receiving_tds": "0",
        "receptions": "176",
        "total_fpts": "376.4",
        "avg_fpts": "23.5",
        "summary": "Tyreek Hill, the dynamic wide receiver for the Kansas City Chiefs, is widely regarded as one of the most electrifying players in the NFL. With his blazing speed and exceptional route-running ability, Hill has earned numerous accolades throughout his career. He boasts an impressive five First Team All-Pro selections and played a pivotal role in the Chiefs' Super Bowl championship victory. Known for his big-play ability and versatility, Hill is a constant threat to opposing defenses both as a receiver and a return specialist. His remarkable speed and unmatched athleticism make him a game-changer on every snap, and his impact on the field is undeniable.",
        "teammates_depth_chart": [
            "26",
            "66",
            "77"
        ]
    },
    "5": {
        "player_id": "5",
        "name": "Jalen Hurts",
        "team": "Philadelphia Eagles",
        "team_short": "Phi",
        "position": "QB",
        "position_full": "Quarterback",
        "number": "1",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4040715.png&w=350&h=254",
        "passing_yds": "3678",
        "passing_tds": "24",
        "ints": "7",
        "rushing_yds": "821",
        "rushing_tds": "5",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "356.82",
        "avg_fpts": "21.0",
        "summary": "Jalen Hurts, the versatile quarterback for the Philadelphia Eagles, has quickly made a name for himself as a rising star in the NFL. With his dual-threat abilities as a passer and a runner, Hurts has electrified fans and confounded defenses since entering the league. His dynamic playing style and leadership qualities have earned him two Pro Bowl selections, showcasing his impact on the field and his growing reputation as a top-tier quarterback. Despite facing challenges and setbacks along the way, Hurts has remained resilient and determined, continuing to improve and evolve his game with each season. As he looks ahead to the future, Jalen Hurts stands poised to become a cornerstone of the Eagles' franchise and a perennial Pro Bowl-caliber player for years to come.",
        "teammates_depth_chart": [
            "18",
            "28",
            "35"
        ]
    },
    "6": {
        "player_id": "6",
        "name": "Dak Prescott",
        "team": "Dallas Cowboys",
        "team_short": "Dal",
        "position": "QB",
        "position_full": "Quarterback",
        "number": "4",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/2577417.png&w=350&h=254",
        "passing_yds": "4516",
        "passing_tds": "36",
        "ints": "9",
        "rushing_yds": "242",
        "rushing_tds": "2",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "342.84",
        "avg_fpts": "20.2",
        "summary": "Dak Prescott, the talented quarterback for the Dallas Cowboys, has made a significant impact on the NFL since his rookie season in 2016. His exceptional performance as a rookie earned him the prestigious NFL Offensive Rookie of the Year award, highlighting his immediate success and promising future in the league. Beyond his accomplishments on the field, Prescott's character and leadership qualities have also been recognized, as evidenced by his receipt of the Walter Payton NFL Man of the Year award in 2022. With his combination of skill, resilience, and integrity, Dak Prescott continues to inspire fans and teammates alike, serving as a positive role model both on and off the field.",
        "teammates_depth_chart": [
            "16",
            "88",
            "91"
        ]
    },
    "7": {
        "player_id": "7",
        "name": "Lamar Jackson",
        "team": "Baltimore Ravens",
        "team_short": "Bal",
        "position": "QB",
        "position_full": "Quarterback",
        "number": "8",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/3916387.png&w=350&h=254",
        "passing_yds": "3678",
        "passing_tds": "24",
        "ints": "7",
        "rushing_yds": "821",
        "rushing_tds": "5",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "331.22",
        "avg_fpts": "20.7",
        "summary": "Lamar Jackson, the electrifying quarterback for the Baltimore Ravens, has cemented his place as one of the most dynamic players in the NFL. With his unique blend of speed, agility, and arm talent, Jackson has revolutionized the quarterback position, earning him widespread acclaim and recognition. His remarkable performances on the field have led to numerous accolades, including two NFL MVP awards, underscoring his dominance and impact on the game. Jackson's ability to excel as both a passer and a rusher has made him a nightmare for opposing defenses, solidifying his status as a transcendent talent in the league. As he continues to evolve and refine his game, Lamar Jackson remains a force to be reckoned with, poised to leave an indelible mark on the NFL for years to come.",
        "teammates_depth_chart": [
            "26",
            "53",
            "61"
        ]
    },
    "8": {
        "player_id": "8",
        "name": "Amon-Ra St. Brown",
        "team": "Detroit Lions",
        "team_short": "Det",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "14",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4374302.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "15",
        "rushing_tds": "0",
        "receiving_yds": "119",
        "receiving_tds": "0",
        "receptions": "119",
        "total_fpts": "330.9",
        "avg_fpts": "20.7",
        "summary": "Amon-Ra St. Brown, the rising star wide receiver for the Detroit Lions, has quickly made a name for himself as one of the most promising talents in the NFL. With his exceptional skills and athleticism, St. Brown has become a key playmaker for his team, consistently delivering outstanding performances on the field. His impressive contributions have earned him recognition as a first-team All-Pro in 2023, showcasing his ability to excel at the highest level of competition. Additionally, St. Brown's consistent impact has been acknowledged with two consecutive Pro Bowl selections in 2022 and 2023, further solidifying his status as one of the league's premier wide receivers. As he continues to hone his craft and evolve as a player, Amon-Ra St. Brown is poised to make even greater strides in the NFL and establish himself as a dominant force for years to come.",
        "teammates_depth_chart": [
            "46",
            "49",
            "95"
        ]
    },
    "9": {
        "player_id": "9",
        "name": "Jordan Love",
        "team": "Green Bay Packers",
        "team_short": "GB",
        "position": "QB",
        "position_full": "Quarterback",
        "number": "10",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4036378.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "24",
        "rushing_tds": "0",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "319.06",
        "avg_fpts": "18.8",
        "summary": "Jordan Love, the talented quarterback for the Green Bay Packers, has shown immense potential since entering the NFL. With his strong arm and impressive athleticism, Love has drawn comparisons to some of the league's top quarterbacks. Although he has primarily served as a backup behind Aaron Rodgers, Love has demonstrated flashes of brilliance whenever given the opportunity. His performances in practice and preseason games have garnered praise from coaches and teammates alike, hinting at a bright future ahead. As he continues to develop and refine his skills, Jordan Love stands poised to become the Packers' quarterback of the future, ready to lead the team to success for years to come.",
        "teammates_depth_chart": [
            "11",
            "36",
            "56"
        ]
    },
    "10": {
        "player_id": "10",
        "name": "Puka Nacua",
        "team": "Los Angeles Rams",
        "team_short": "LAR",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "17",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4426515.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "21",
        "rushing_tds": "1",
        "receiving_yds": "96",
        "receiving_tds": "0",
        "receptions": "105",
        "total_fpts": "298.5",
        "avg_fpts": "17.6",
        "summary": "Puka Nacua, the dynamic wide receiver for the Los Angeles Rams, burst onto the NFL scene with an extraordinary rookie campaign. His exceptional playmaking ability and knack for making big plays quickly made him a fan favorite and a crucial component of the Rams' offense. Nacua's remarkable rookie season was highlighted by a multitude of achievements, including setting several NFL records for rookie wide receivers. His prolific reception and receiving yardage totals shattered previous benchmarks, cementing his status as one of the most promising young talents in the league. Additionally, Nacua's postseason heroics further solidified his reputation as a clutch performer, showcasing his ability to thrive in high-pressure situations. With his combination of skill, athleticism, and work ethic, Puka Nacua is poised to continue making a significant impact on the NFL for years to come.",
        "teammates_depth_chart": [
            "14",
            "22",
            "55"
        ]
    },
    "11": {
        "player_id": "11",
        "name": "Brock Purdy",
        "team": "San Francisco 49ers",
        "team_short": "SF",
        "position": "QB",
        "position_full": "Quarterback",
        "number": "13",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4361741.png&w=350&h=254",
        "passing_yds": "4280",
        "passing_tds": "31",
        "ints": "11",
        "rushing_yds": "144",
        "rushing_tds": "2",
        "receiving_yds": "0",
        "receiving_tds": "0",
        "receptions": "0",
        "total_fpts": "295.6",
        "avg_fpts": "18.5",
        "summary": "Brock Purdy, the standout quarterback for the San Francisco 49ers, has established himself as one of the premier players in the NFL. In his first two seasons as the starting quarterback, Purdy led the 49ers to the Super Bowl and the NFC Championship game, showcasing his ability to perform under pressure on the biggest stages. His exceptional performance earned him a spot in the Pro Bowl and garnered MVP votes, underscoring his impact on the team's success. Purdy's leadership, accuracy, and mobility make him a dynamic force on the field, capable of making game-changing plays both through the air and on the ground. With his proven track record of success and relentless drive to excel, Brock Purdy is poised to continue his ascent as one of the top quarterbacks in the league for years to come.",
        "teammates_depth_chart": [
            "14",
            "22",
            "55"
        ]
    },
    "12": {
        "player_id": "12",
        "name": "Breece Hall",
        "team": "New York Jets",
        "team_short": "NYJ",
        "position": "RB",
        "position_full": "Running Back",
        "number": "20",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4427366.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "994",
        "rushing_tds": "5",
        "receiving_yds": "591",
        "receiving_tds": "4",
        "receptions": "76",
        "total_fpts": "290.5",
        "avg_fpts": "17.1",
        "summary": "Breece Hall, the electrifying running back for the New York Jets, took the NFL by storm in his rookie season, earning the prestigious Offensive Rookie of the Year award for his outstanding performance. Hall's exceptional talent and versatility were on full display as he showcased his ability to dominate both as a rusher and a receiver out of the backfield. His impressive stat line of 1,456 rushing yards, 11 rushing touchdowns, 385 receiving yards, and 3 receiving touchdowns solidified his status as one of the league's most dynamic playmakers. Hall's impact went beyond the box score, as his explosive runs and game-changing plays energized the Jets' offense and electrified fans across the league. With his combination of speed, power, and agility, Breece Hall is poised to be a cornerstone of the Jets' offense for years to come, setting the stage for a bright future in the NFL.",
        "teammates_depth_chart": [
            "14",
            "22",
            "55"
        ]
    },
    "49": {
        "player_id": "49",
        "name": "Brandin Cooks",
        "team": "Dallas Cowboys",
        "team_short": "Dal",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "3",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/16731.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "35",
        "rushing_tds": "0",
        "receiving_yds": "657",
        "receiving_tds": "8",
        "receptions": "54",
        "total_fpts": "173.2",
        "avg_fpts": "10.8",
        "summary": "Brandin Cooks, the dynamic wide receiver for the Dallas Cowboys, made an immediate impact in his first season with the team. Cooks showcased his exceptional speed, route-running ability, and reliable hands, becoming a go-to target for quarterback Dak Prescott. His impressive stat line of 1,327 receiving yards, 9 receiving touchdowns, and 113 receptions demonstrated his ability to consistently produce big plays and move the chains for the Cowboys' offense. Cooks' knack for making contested catches and his ability to stretch the field added a new dimension to the Cowboys' passing attack, keeping opposing defenses on their toes. With his combination of talent and experience, Brandin Cooks emerged as a key playmaker for the Cowboys and played a crucial role in their success during the 2023 NFL season.",
        "teammates_depth_chart": [
            "1",
            "189"
        ]
    },
    "118": {
        "player_id": "118",
        "name": "sdf",
        "team": "Giants",
        "team_short": "NYG",
        "position_full": "WR",
        "position": "8",
        "number": "8",
        "image": "httet",
        "passing_yds": "199",
        "passing_tds": "99",
        "ints": "9",
        "rushing_yds": "9",
        "rushing_tds": "9",
        "receiving_yds": "9",
        "receiving_tds": "9",
        "receptions": "9",
        "total_fpts": "9",
        "avg_fpts": "9",
        "summary": "He is great",
        "teammates_depth_chart": [
            "34,4,5"
        ]
    },
    "189": {
        "player_id": "189",
        "name": "Michael Gallup",
        "team": "Dallas Cowboys",
        "team_short": "Dal",
        "position": "WR",
        "position_full": "Wide Receiver",
        "number": "13",
        "image": "https://a.espncdn.com/combiner/i?img=/i/headshots/nfl/players/full/4036348.png&w=350&h=254",
        "passing_yds": "0",
        "passing_tds": "0",
        "ints": "0",
        "rushing_yds": "0",
        "rushing_tds": "0",
        "receiving_yds": "418",
        "receiving_tds": "2",
        "receptions": "34",
        "total_fpts": "87.7",
        "avg_fpts": "5.2",
        "summary": "Michael Gallup, the versatile wide receiver for the Dallas Cowboys, continued to be a reliable and explosive playmaker for the team during the 2023 NFL season. Despite facing some injury challenges, Gallup showcased his resilience and determination, contributing valuable yardage and touchdowns to the Cowboys' offense. His ability to create separation, make contested catches, and gain yards after the catch made him a favorite target for quarterback Dak Prescott. Gallup's speed and agility allowed him to excel in both short-yardage and deep-ball situations, providing the Cowboys with a dynamic threat in the passing game. With his consistent performance and big-play potential, Michael Gallup proved to be an integral part of the Cowboys' offensive success, helping propel the team to victory in key matchups throughout the season.",
        "teammates_depth_chart": [
            "1",
            "49"
        ]
    }
}